<template>
  <div class="container">
    <div class="row">
      <PageHeading 
        text="ข้อกำหนดและเงื่อนไข"
      />
      <div class="col term-content _pdh-32px _pdh-128px-md _pdh-256px-lg _fs-5">
        <p class="_tal-ct">คำว่า บริษัท ในที่นี้หมายถึง บริษัท เมเปิ้ลไลฟ์ จำกัด</p>
        <ul class="_pdt-48px _pdbt-16px _mgl-16px">
          <li 
            v-for="(li, i) in list" 
            :key="i" 
            v-html="li" 
            class="_fw-300 _lh-150pct _pdbt-16px"
          />
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
import PageHeading from '~/components/text/PageHeading'

export default {
    data: () => ({
      list: [
          'เครื่องตรวจน้ำตาลจากเลือดที่ซื้อจากทางบริษัทจะมีการรับประกันความเสียหายที่เกิดจากขั้นตอน	การผลิตทุกเครื่องเป็นระยะเวลา 3 ปี โดยการรับประกันจะไม่ครอบคลุมความเสียหายที่เกิดจากการใช้งาน การเสื่อมสภาพตามกาลเวลาอันสมควร',
          'ทางบริษัทขอสงวนสิทธิ์ในการไม่รับเปลี่ยน หรือคืนสินค้านอกเหนือจากเงื่อนไขการรับประกัน	ผลิตภัณฑ์ตามข้างต้น', 
          'ราคาสินค้าทุกอย่าง ยกเว้นแพ็คเกจรายเดือน จะไม่รวมค่าจัดส่งสินค้า', 
          'การเข้ามาใช้งานเว็บไซต์ของบริษัท (maplelife.co.th) และการดำเนินธุรกรรมใดๆ กับทางบริษัท 	ถือว่าทางลูกค้า และผู้ที่ดำเนินธุรกรรมดังกล่าวได้ยินยอมให้ทางบริษัทสามารถจัดเก็บข้อมูลที่เกี่ยว	กับลูกค้าและผู้ที่ดำเนินธุรกรรมดังกล่าวเพื่อนำไปใช้ในกิจกรรมการตลาดโดยบริษัท หรือโดย	พันธมิตรทางการค้าของบริษัท',
          'หากมีการโต้แย้งระหว่างบริษัท หรือพนักงานของบริษัท กับลูกค้า ทางบริษัทขอสงวนสิทธิ์ว่าคำ	ตัดสินของบริษัทถือเป็นที่สิ้นสุด  '
      ]
    }),
  components: {
      PageHeading
  },
}
</script>

<style lang="scss" scoped>
  ul{
    li{
      list-style-type: disc;
    }
  }
  .term-content{
    font-family: 'Kanit', sans-serif;
  }
</style>
